Repository: wpbones/WPKirk-Options-Boilerplate
Catalog: languages/wp-kirk-*.po
Languages: it_it

source: WP Kirk Options Boilerplate
it_it: WP Kirk Opzioni Boilerplate

source: WP Bones Boilerplate WordPress plugin
it_it: WP Bones Boilerplate Plugin WordPress

source: Hello, Captain!
it_it: Salve, Capitano!

source: Options
it_it: Opzioni

source: Options View
it_it: Visualizzazione opzioni

source: Options Resource
it_it: Risorsa Opzioni

source: Hello
it_it: Ciao

source: Overview
it_it: Panoramica

source: You can define the plugin options in the `options.php` file.
it_it: È possibile definire le opzioni del plugin nel file 'options.php'.

source: You can always access the plugin instance by using the `$plugin` variable.
it_it: È sempre possibile accedere all'istanza del plug-in utilizzando la variabile '$plugin'.

source: Get options
it_it: Ottieni opzioni

source: You can get the options by using the `dot` notation.
it_it: È possibile ottenere le opzioni utilizzando la notazione "punto".

source: You can also store `null` values.
it_it: È inoltre possibile memorizzare valori 'null'.

source: Get options by an array
it_it: Ottenere opzioni da un array

source: You may also retrieve an option sub-branch as an `Array`.
it_it: È anche possibile recuperare un sottoramo di opzione come 'Array'.

source: as well as
it_it: così come

source: Get option directly
it_it: Ottieni direttamente l'opzione

source: You can also get the options without using the `get` method.
it_it: Puoi anche ottenere le opzioni senza utilizzare il metodo "get".

source: Get default value
it_it: Ottenere il valore predefinito

source: Of course, you can also get the default value if the option does not exist.
it_it: Naturalmente, puoi anche ottenere il valore predefinito se l'opzione non esiste.

source: Add new option
it_it: Aggiungi nuova opzione

source: You can add a new option by using the `set` method.
it_it: È possibile aggiungere una nuova opzione utilizzando il metodo 'set'.

source: You can also add new entry options with `null` value.
it_it: È inoltre possibile aggiungere nuove opzioni di immissione con valore 'nullo'.

source: Of course, you can also add a new option by using the `Array` notation.
it_it: Naturalmente, è possibile aggiungere una nuova opzione utilizzando la notazione 'Array'.

source: Of course, you can also add a new option starting from the root.
it_it: Naturalmente, puoi anche aggiungere una nuova opzione partendo dalla radice.

source: Update an option
it_it: Aggiornare un'opzione

source: You can update any option and branch tree in the same way, by using the dot notation
it_it: È possibile aggiornare qualsiasi opzione e albero di ramificazione allo stesso modo, utilizzando la notazione a punti

source: By using the `Array` notation
it_it: Utilizzando la notazione 'Array'

source: You can also change the type of the value.
it_it: È inoltre possibile modificare il tipo di valore.

source: Mass insert and update
it_it: Inserimento e aggiornamento di massa

source: In accordance with the options structure, you may also update a whole subset of options instead of changing them individually.
it_it: In conformità con la struttura delle opzioni, è possibile aggiornare un intero sottoinsieme di opzioni invece di modificarle individualmente.

source: Of course, you may use the mass feature for the insert as well
it_it: Naturalmente, è possibile utilizzare la funzione di massa anche per l'inserto

source: Delete option
it_it: Cancella opzione

source: To delete an option, you have to use the `delete` method.
it_it: Per eliminare un'opzione, è necessario utilizzare il metodo 'delete'.

source: Delete all
it_it: Cancella tutto

source: Finally, you can delete all options.
it_it: Infine, puoi eliminare tutte le opzioni.

source: Don't worry, you can reset the options to the default values.
it_it: Non preoccuparti, puoi ripristinare le opzioni ai valori predefiniti.

source: Here we are going to use the resource approach to handle the form submission.
it_it: Qui utilizzeremo l'approccio delle risorse per gestire l'invio del modulo.

source: Menus
it_it: Menu

source: In the `menus.php` file you can define the menu items.
it_it: Nel file 'menus.php' è possibile definire le voci di menu.

source: At line `43` and `44` we have defined the `load` and `resource`menu item routes.
it_it: Alle righe '43' e '44' abbiamo definito gli itinerari delle voci di menu 'carico' e 'risorsa'.

source: Controller
it_it: Controllore

source: In the `OptionResourceController.php` file you will find several methods to handle the form submission.
it_it: Nel file 'OptionResourceController.php' troverai diversi metodi per gestire l'invio del modulo.

source: Method
it_it: Metodo

source: We can use the `$method` injected variable to display the current method.
it_it: Possiamo usare la variabile iniettata '$method' per visualizzare il metodo corrente.

source: Here you can try the ability to handle a form for the options.
it_it: Qui puoi provare la capacità di gestire un modulo per le opzioni.

source: At line `36` we have the `post` menu item route which will be used to handle the form update.
it_it: Alla riga '36' abbiamo la voce di menu 'post' route che verrà utilizzata per gestire l'aggiornamento del modulo.

source: In the `OptionViewController.php` file you will find the method `saveOptions` which will handle the form submission.
it_it: Nel file 'OptionViewController.php' troverai il metodo 'saveOptions' che gestirà l'invio del modulo.

source: We will use the `verifyNonce()` method to verify the nonce.
it_it: Utilizzeremo il metodo 'verifyNonce()' per verificare il nonce.

source: And we will use the `getAsOptions()` method to get the form fields as options.
it_it: E useremo il metodo 'getAsOptions()' per ottenere i campi del modulo come opzioni.

source: View Form
it_it: Visualizza modulo

source: Here we're using a very useful HTML markup to display and handle the form fields. First of all, we are going to set up the nonce field.
it_it: Qui stiamo utilizzando un markup HTML molto utile per visualizzare e gestire i campi del modulo. Prima di tutto, imposteremo il campo nonce.

source: Then we will use `$feedback` injected variable to display a message if the form was submitted.
it_it: Quindi utilizzeremo la variabile iniettata '$feedback' per visualizzare un messaggio se il modulo è stato inviato.

source: We will use a `div` with class `updated notice is-dismissible` to display the message on the top of the page.
it_it: Useremo un 'div' con la classe 'l'avviso aggiornato è-ignorabile' per visualizzare il messaggio nella parte superiore della pagina.

source: Try it
it_it: Provalo

source: The current options are:
it_it: Le opzioni attuali sono:

source: Say Hello, WP Bones Application
it_it: Saluta, Applicazione WP Bones
